In [99]:
# Reference  # https://towardsdatascience.com/heres-how-to-run-sql-in-jupyter-notebooks-f26eb90f3259

In [100]:
# !pip install ipython-sql

In [101]:
# !pip install sqlalchemy

In [102]:
# !pip install mysqlclient

In [1]:
import sqlalchemy
from getpass import getpass
from IPython.display import display
import pandas as pd

In [4]:
username = input("Enter UserName: ")
password = getpass("Enter Password: ")
# sqlalchemy.create_engine(f'mysql://{user}:{password}@localhost:3306')
connect = sqlalchemy.create_engine(f'mysql://{username}:{password}@localhost:3306/dbbook_small')

Enter UserName: root
Enter Password: ········

In [17]:
# %reload_ext sql

In [13]:
# %sql mysql://{username}:{password}@localhost:3306/dbbook_small

In [16]:
# %sql show databases;
# %sql use dbbook_small;
# %sql select * from classroom;

In [24]:
# advisor = %sql select * from advisor;
# print(advisor)

In [25]:
display(pd.read_sql_query("select * from advisor",connect))
display(pd.read_sql_query("select * from classroom",connect))

    s_ID   i_ID
0  12345  10101
1  44553  22222
2  45678  22222
3  00128  45565
4  76543  45565
5  23121  76543
6  98988  76766
7  76653  98345
8  98765  98345

  building room_number  capacity
0  Packard         101     500.0
1  Painter         514      10.0
2   Taylor        3128      70.0
3   Watson         100      30.0
4   Watson         120      50.0

In [35]:
%%sql 
select * from takes

 * mysql://root:***@localhost:3306/dbbook_small
22 rows affected.

[('00128', 'CS-101', '1', 'Fall', Decimal('2017'), 'A'),
 ('00128', 'CS-347', '1', 'Fall', Decimal('2017'), 'A-'),
 ('12345', 'CS-101', '1', 'Fall', Decimal('2017'), 'C'),
 ('12345', 'CS-190', '2', 'Spring', Decimal('2017'), 'A'),
 ('12345', 'CS-315', '1', 'Spring', Decimal('2018'), 'A'),
 ('12345', 'CS-347', '1', 'Fall', Decimal('2017'), 'A'),
 ('19991', 'HIS-351', '1', 'Spring', Decimal('2018'), 'B'),
 ('23121', 'FIN-201', '1', 'Spring', Decimal('2018'), 'C+'),
 ('44553', 'PHY-101', '1', 'Fall', Decimal('2017'), 'B-'),
 ('45678', 'CS-101', '1', 'Fall', Decimal('2017'), 'F'),
 ('45678', 'CS-101', '1', 'Spring', Decimal('2018'), 'B+'),
 ('45678', 'CS-319', '1', 'Spring', Decimal('2018'), 'B'),
 ('54321', 'CS-101', '1', 'Fall', Decimal('2017'), 'A-'),
 ('54321', 'CS-190', '2', 'Spring', Decimal('2017'), 'B+'),
 ('55739', 'MU-199', '1', 'Spring', Decimal('2018'), 'A-'),
 ('76543', 'CS-101', '1', 'Fall', Decimal('2017'), 'A'),
 ('76543', 'CS-319', '2', 'Spring', Decimal('2018'), 'A'),
 ('76653', 'EE-181', '1', 'Spring', Decimal('2017'), 'C'),
 ('98765', 'CS-101', '1', 'Fall', Decimal('2017'), 'C-'),
 ('98765', 'CS-315', '1', 'Spring', Decimal('2018'), 'B'),
 ('98988', 'BIO-101', '1', 'Summer', Decimal('2017'), 'A'),
 ('98988', 'BIO-301', '1', 'Summer', Decimal('2018'), None)]